{
  "format": "layers-model",
  "generatedBy": "Keras 2.15.0",
  "convertedBy": "Manual Conversion",
  "modelTopology": {
    "keras_version": "2.15.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                8
              ],
              "dtype": "float32",
              "sparse": false,
              "name": "input_layer"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "units": 64,
              "activation": "relu",
              "use_bias": true
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout",
              "trainable": true,
              "rate": 0.2,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "units": 32,
              "activation": "relu",
              "use_bias": true
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "trainable": true,
              "rate": 0.2,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "units": 16,
              "activation": "relu",
              "use_bias": true
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_3",
              "trainable": true,
              "units": 1,
              "activation": "linear",
              "use_bias": true
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense/kernel",
          "shape": [
            8,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            64,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            32,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/kernel",
          "shape": [
            16,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/bias",
          "shape": [
            1
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}